In [48]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import seaborn as sns

In [49]:
titanic = sns.load_dataset('titanic')

In [50]:
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

### 기본적인 자료 분석

#### 자료에 나온 사람은 총 몇 명이고 이 중 생존자와 사망자는 몇 명일까?

In [51]:
print('총 인원:', titanic['survived'].count())
print('생존자:', titanic['survived'].sum())
print('사망자:', titanic['survived'].count() - titanic['survived'].sum())

총 인원: 891
생존자: 342
사망자: 549

#### 1, 2, 3등석 승객은 각각 몇 명이었을까?

In [58]:
print(titanic['class'].value_counts().sort_index())

First     216
Second    184
Third     491
Name: class, dtype: int64

#### 남성과 여성은 각각 몇 명이었을까?

In [53]:
print(titanic['sex'].value_counts().sort_index())

female    314
male      577
Name: sex, dtype: int64

#### 평균 연령은 얼마였을까?

In [54]:
print(titanic['age'].mean())

29.69911764705882

#### 평균 승선료는 얼마였을까?

In [55]:
print(titanic['fare'].mean())

32.2042079685746

#### 최고, 최저 승선료는 얼마였을까?

In [59]:
print(titanic['fare'].max())
print(titanic['fare'].min())

512.3292
0.0

#### 세 항구에서 탄 사람들은 각각 몇 명이었을까?

In [61]:
print(titanic['embarked'].value_counts().sort_values())

Q     77
C    168
S    644
Name: embarked, dtype: int64

#### 성인 남성의 숫자는 몇 명이었을까?

In [62]:
print(titanic['adult_male'].value_counts().sort_index())

False    354
True     537
Name: adult_male, dtype: int64